"""KeyError - когато ключ от речник не е намерен в набора от съществуващите ключове

AttributeError - когато препратка към атрибут или присвояване е неуспешно
 
ValueError - когато операция или функция получи аргумент, който е с правилния тип, 
            но с неподходяща/невалидна стойност.
 
NameError - когато името на променлива, локална или глобална, не е намерено
 
TypeError - когато операция или функция е зададена на обект, но с неподходящ тип.
            Използва се, за да подскаже, че подадената операция към обект е неправилна и няма да работи
 
IndexError - когато индексът на обект от масив е извън обхвата
 
ModuleNotFoundError - повдига се от import, когато импортираният модул не 
                    може да бъде открит или когато в sys.modules се намери None.
 
ZeroDivisionError - при делене на 0

RuntimeError - когато е засечена грешка, но тя не попада в нито една от другите катерогии
 
FileNotFoundError - когато е извикан файл или директория, която не съществува

OSError - когато системна функция върне системна грешка - file not found, disk full и т.н."""""
